
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика    
	табдок = ПолучитьИзВременногоХранилища(Параметры.АдресВХ);
	
	Диаграмма.Обновление = Ложь;
	Для каждого стр Из табдок Цикл
		Точка = Диаграмма.УстановитьТочку(стр.Сотрудник);
		Серия = Диаграмма.УстановитьСерию("Отпуск");
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = стр.ДатаНачала;
		Интервал.Конец = стр.ДатаОкончания;
		
	КонецЦикла;   
	Диаграмма.Обновление = Истина;
КонецПроцедуры
