Функция СоздатьАкты(СтруктПараметры) Экспорт
	
	Таблица = СтруктПараметры.ТаблицаДоговоров;
	Для каждого СтрокаТЧ Из Таблица цикл 
		Если ЗначениеЗаполнено(СтрокаТЧ.Документ) Тогда
		    Продолжить;
		КонецЕсли;
		НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
		НовыйДок.Дата = СтруктПараметры.ДатаОкончания;
		ЗаполнитьЗначенияСвойств(НовыйДок, СтрокаТЧ);
	    НовыйДок.ВКМ_ВыполнитьАвтозаполнение();
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
		СтрокаТЧ.Документ = НовыйДок.Ссылка;
	КонецЦикла;   
	
     
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Таблица", Таблица);
	Возврат СтруктураРезультат;  
	
КонецФункции 