

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
	//++олег
	Группа = Элементы.Добавить("ГруппаАбонСопр", Тип("ГруппаФормы"), ЭтаФорма);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "Абонентское сопровождение";
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ПолеВвода = Элементы.Добавить("ЭлементДатаНачала", Тип("ПолеФормы"), Группа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
	
	ПолеВвода = Элементы.Добавить("ЭлементДатаОкончания", Тип("ПолеФормы"), Группа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
	
	ПолеВвода = Элементы.Добавить("ЭлементАбонентскаяПлата", Тип("ПолеФормы"), Группа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";

	ПолеВвода = Элементы.Добавить("ЭлементСтоимостьЧаса", Тип("ПолеФормы"), Группа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
	//--
КонецПроцедуры




&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//TODO: Вставить содержимое обработчика
	ВКМ_ДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
	//++олег
	ВКМ_ДоступностьРеквизитов();
	//--
КонецПроцедуры

&НаКлиенте
//++олег
Процедура ВКМ_ДоступностьРеквизитов()
	Видимость = (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
	Элементы.ГруппаАбонСопр.Видимость = Видимость;
//	Элементы.ЭлементДатаНачала.Видимость = Видимость;
//	Элементы.ЭлементДатаОкончания.Видимость = Видимость;
//	Элементы.ЭлементАбонентскаяПлата.Видимость = Видимость;
//	Элементы.ЭлементСтоимостьЧаса.Видимость = Видимость;
КонецПроцедуры
//--
